src/Documents/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расход</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасхода</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Расход/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма документа Расход.
// HTML-интерфейс «Новый расход» по макету Wallet.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Дата = ТекущаяДата();
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
		ЗаполнитьСчетПоУмолчанию();
		Заголовок = "Новый расход";
		
	Иначе
		
		Заголовок = "Расход";
		
	КонецЕсли;
	
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "ВыборДаты" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметр.Время) Тогда
		
		Часов = Час(Параметр.Время);
		Минут = Минута(Параметр.Время);
		Секунд = Секунда(Параметр.Время);
		ВсегоСекунд = Часов * 3600 + Минут * 60 + Секунд;
		
	Иначе
		
		ВсегоСекунд = 0;
		
	КонецЕсли;
	
	Объект.Дата = Параметр.Период + ВсегоСекунд;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Или КомандаПриложения = "noop" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбработатьКомандуHTML(КомандаПриложения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьКомандуHTML(КомандаПриложения)
	
	Если КомандаПриложения = "back"
		Или КомандаПриложения = "home"
		Или КомандаПриложения = "operations"
		Или КомандаПриложения = "reports"
		Или КомандаПриложения = "catalogs"
		Или КомандаПриложения = "settings" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "history" Тогда
		
		ОткрытьФорму("Документ.Расход.Форма.ФормаСписка", , ЭтотОбъект, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли КомандаПриложения = "account" Тогда
		
		НачатьВыборСчета();
		
	ИначеЕсли КомандаПриложения = "category" Тогда
		
		НачатьВыборКатегории();
		
	ИначеЕсли КомандаПриложения = "clear-sum" Тогда
		
		Объект.Сумма = 0;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "edit-sum" Или КомандаПриложения = "other-sum" Тогда
		
		НачатьВводСуммы();
		
	ИначеЕсли СтрНачинаетсяС(КомандаПриложения, "add:") Тогда
		
		Добавка = Число(Сред(КомандаПриложения, СтрДлина("add:") + 1));
		Объект.Сумма = Объект.Сумма + Добавка;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "date" Тогда
		
		НачатьВыборДаты();
		
	ИначеЕсли КомандаПриложения = "edit-comment" Тогда
		
		НачатьВводКомментария();
		
	ИначеЕсли КомандаПриложения = "submit" Тогда
		
		ЗаписатьДокументРасхода();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборСчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСчета", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВыборСчета(ОписаниеОповещения, Объект.Счет, "Счет списания");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСчета(ВыбранныйСчет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйСчет = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Счет = ВыбранныйСчет;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборКатегории()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКатегории", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВыборКатегории(ОписаниеОповещения, Истина, Объект.КатегорияРасхода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКатегории(ВыбраннаяКатегория, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяКатегория = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.КатегорияРасхода = ВыбраннаяКатегория;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводСуммы()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаСуммы", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВводСуммы(ОписаниеОповещения, Объект.Сумма, "Сумма расхода", "expense");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммы(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Число < 0 Тогда
		
		Число = 0;
		
	КонецЕсли;
	
	Объект.Сумма = Число;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборДаты()
	
	ПараметрыКалендаря = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		
		ПараметрыКалендаря.Вставить("Дата", Объект.Дата);
		
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", ПараметрыКалендаря, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводКомментария()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Комментарий, "Комментарий", 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментария(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Комментарий = Лев(Строка, 100);
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументРасхода()
	
	Если Не ЗначениеЗаполнено(Объект.Счет) Тогда
		
		ПоказатьПредупреждение(, "Выберите счёт списания.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияРасхода) Тогда
		
		ПоказатьПредупреждение(, "Выберите категорию.");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Сумма <= 0 Тогда
		
		ПоказатьПредупреждение(, "Укажите сумму расхода больше нуля.");
		Возврат;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ВыполнитьЗаписьДокументаРасхода", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьДокументаРасхода() Экспорт
	
	ТекстОшибки = ЗаписатьИПровестиНаСервере();
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		
		Если Открыта() Тогда
			
			Закрыть(Истина);
			
		КонецЕсли;
		
	Иначе
		
		ПоказатьПредупреждение(, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИПровестиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Счет) Тогда
		
		Возврат "Выберите счёт списания.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КатегорияРасхода) Тогда
		
		Возврат "Выберите категорию.";
		
	КонецЕсли;
	
	Если Объект.Сумма <= 0 Тогда
		
		Возврат "Укажите сумму расхода больше нуля.";
		
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	Данные = Новый Структура;
	Данные.Вставить("Дата", Объект.Дата);
	Данные.Вставить("Счет", Объект.Счет);
	Данные.Вставить("Категория", Объект.КатегорияРасхода);
	Данные.Вставить("Сумма", Объект.Сумма);
	Данные.Вставить("Комментарий", Объект.Комментарий);
	Данные.Вставить("Заголовок", Заголовок);
	ТекстHTML = ОбщийМодульСервер_ДокументыUI.HTMLФормыДоходаРасхода(Истина, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетПоУмолчанию()
	
	Если ЗначениеЗаполнено(Объект.Счет) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кошелек.Ссылка КАК Счет
	|ИЗ
	|	Справочник.Счета КАК Кошелек
	|ГДЕ
	|	НЕ Кошелек.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Кошелек.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Объект.Счет = Выборка.Счет;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(Знач АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	АдресСсылки = СокрЛП(АдресСсылки);
	Позиция = СтрНайти(НРег(АдресСсылки), "app:");
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(АдресСсылки, Позиция + 4);
	
КонецФункции

#КонецОбласти
